var obj = Object.create({ a: 1}); // Створення обєкту з наслідуванням в даному випадку наслідуєм 'а'
obj.b = 2;
obj['c'] = 3;
console.log(obj); // 'а' непоказує
console.log(obj.hasOwnProperty('a')); //Перевіряєм обєкт чи він містить власне поле 'а' в результаті маємо false томущо 'а' наслідується
console.log('a' in obj); //Перевіряємо чи обєкт має 'а' влючаюче наслідування в результаті маємо true
console.log(obj.a);// якщо напряму доступатися до 'а' то ми будемо бачити значення 'а'
obj.a = 4;
console.log(obj.a);// якщо додати 'а' то ми будемо вже доступатись до 'а' яке ми вже додали в обєкт
console.log(obj);

delete obj.c;
console.log(obj);
